{"pages":[{"url":"https://cigadung.github.io/about","text":"Selamat datang di web kami, Cigadung FC. Apa sih Cigadung FC? Bagi yg suka bola, mungkin langsung nanya: Saingan Persib ya? :-D Bagi yg suka makan, mungkin akan mikir: Jualan ayam saja kok pakei code , devops segala macem ... Bukanlah prens... Mungkin saja suatu saat jadi Football Club dan saingan Persib betulan. Jadi juragan Fried Chicken juga possible. Tapi sekarang kita mulai dengan yg fun-fun saja ... coding, devops-ing, curhat-ing dll. Jadi cerita awalnya FC = Fun Coders . Cigadung adalah nama jalan di sekitaran Dago, Bandung Utara. Jadi Cigadung FC teh Dev Community? OTB? atau apa? Komunitas iya. Dev mah bisa ya bisa tidak. OTB? mungkin. Versi TL;DR-nya, Cigadung FC ini cerita awalnya adalah komunitas dan media untuk ngumpul virtual, sharing atau segala macemnya dari para personal ( aktif maupun veteran ) QIT/Qinti/Qisofi yang markasnya di Cigadung. Walaupun begitu, Cigadung FC ini terbuka dan tidak berafiliasi dengan perusahaan ya.. dan kalau ada dari men-temen yg mau aktif dan mau gabung dengan kita, mangga welcome sekali.. Kalau ada momen menarik, kesempatan dan sponsor..mungkin kedepannya kita ngadain kopdar juga.. Sementara sudah dulu ya, ntar kepanjangan :-D","tags":"pages","title":"About"},{"url":"https://cigadung.github.io/blog/snippet-cbot-untuk-post-barusan","text":"Berikut snippet perintah yg digunakan untuk men-generate post yang barusan (https://cigadung.github.io/blog/trending-hari-ini) # prepare new post .new post .title set Trending Hari Ini .content add Repo trending di github hari ini, untuk semua bahasa. # get/print trending list + select + render .ght list .ght select all .ght render # check .print .gist # submit + push .submit .push Notes: .ght select all memindahkan semua item pada list .ght list untuk bahasa yg aktif ( .ght switch all|java|javascript|python ). Kalau mau custom, pilih item yg sesuai dengan perintah .ght select <index> dan sebelumnya, untuk mengetahui index, via command .ght print .","tags":"coding","title":"Snippet CBOT untuk Post Barusan"},{"url":"https://cigadung.github.io/blog/trending-hari-ini","text":"Repo trending di github hari ini, untuk semua bahasa. Repo Description facebookincubator/create-react-app Create React apps with no build configuration. hemanth/functional-programming-jargon Jargon from the functional programming world in simple terms! FallibleInc/security-guide-for-developers Security Guide for Developers AHAAAAAAA/PokemonGo-Map Live visualization of all the pokemon in your area... and more! jhalterman/failsafe Simple, sophisticated failure handling Grover-c13/PokeGOAPI-Java Pokemon Go API KhronosGroup/Vulkan-Hpp Open-Source Vulkan C++ API wireapp/wire-ios Wire iOS client (iPhone and iPad) jaywcjlove/awesome-mac This repo is a collection of awesome Mac applications and tools for developers and designers. PokemonGoF/PokemonGo-Bot The Pokemon Go Bot script, baking with community. NecronomiconCoding/NecroBot a Pokemon Go Bot based on Rocket API wireapp/wire-android Wire Android UI Microsoft/api-guidelines Microsoft REST API Guidelines Dooskington/GameLad An (almost) fully featured Game Boy emulator. sahat/hackathon-starter A boilerplate for Node.js web applications TomTheBotter/Pokemon-Go-Bot-Working-Hack-API This is one of the fastest bot that farms for Pokestops and Pokemon and super easy to level up. Incubate and hatch eggs by walking or catch rare pokemon fast! No bans with correct use as of now. Use with caution as with all bots. JackyAndroid/AndroidInterview-Q-A The top Internet companies android interview questions and answers hypotext/notation Collection of quotes on interesting notations & how they affect thought. omkarmoghe/Pokemap A native Android client to map the Pokemon around you! Mila432/Pokemon_Go_API Pokmon GO API in Python wireapp/wire Overview of the open source code for Wire goldfire/howler.js Javascript audio library for the modern web. AnthonyOSX/GO-Bot Automation platform for the popular game Pokemon GO. mchristopher/PokemonGo-DesktopMap Electron App around PokemonGo-Map wireapp/wire-webapp Wire for Web https://app.wire.com","tags":"misc","title":"Trending Hari Ini"},{"url":"https://cigadung.github.io/blog/expressjs-hello","text":"Hello World via Express.JS var express = require ( 'express' ); var app = express (); app . get ( '/' , function ( req , res ) { res . send ( 'Hello World!' ); }); app . listen ( 3000 , function () { console . log ( 'Example app listening on port 3000!' ); }); Hope, automatic build ok now.","tags":"coding","title":"Express.JS Hello"},{"url":"https://cigadung.github.io/blog/pasang-webhook","text":"Post baru ini buat nyoba github webhook. Flow-nya kurang lebih seperti ini: kalau ada push/commit baru di branch source , server (CI/CD) akan melakukan git pull dilanjutkan dengan proses build, dan kalau sukses, akan diteruskan dengan git push ke master branch. Try no: 1. Hopefully, gak mesti increment :-D Try no: 2. No problem .. :-D","tags":"misc","title":"Pasang Webhook"},{"url":"https://cigadung.github.io/blog/penampakan-v20","text":"Ini versi penampakan yg lebih jelas.. Distribusi lokasi duduknya tidak simetris. Entah ada apa dipojokan situ ya :-D .. Ini foto masih acara jumat sharing, di markas Qinti Cigadung.","tags":"People","title":"Penampakan v2.0"},{"url":"https://cigadung.github.io/blog/pelican-install-config","text":"# Check pip $ pip install --upgrade pip $ pip -V pip 8.1.1 from /usr/lib/python2.7/dist-packages ( python 2.7 ) # Install virtualenv $ sudo pip install virtualenv # Install virtualenv $ virtualenv cigadung-pelican New python executable in /home/em/statik/cigadung-pelican/bin/python ... # Activate $ cd cigadung-pelican/ $ source bin/activate ( cigadung-pelican ) em@g473:~/statik/cigadung-pelican$ # Install pelican + others $ pip install pelican $ pip install Markdown $ pip install typogrify $ pip install beautifulsoup4 # Clone pelican-plugins $ git clone https://github.com/getpelican/pelican-plugins.git # Clone pelican-themes (semua theme, hanya utk eksperimen) $ git clone --recursive https://github.com/getpelican/pelican-themes ./pelican-themes # Generator, QA $ pelican-quickstart # Makefile bawaan pelican-quickstart $ make devserver $ make stopserver $ make clean #!/usr/bin/env python # -*- coding: utf-8 -*- # from __future__ import unicode_literals import os AUTHOR = 'CFC Admin' SITENAME = 'Cigadung FC' SITEURL = 'http://localhost:8000' PATH = 'content' TIMEZONE = 'Asia/Jakarta' DEFAULT_LANG = 'en' # Feed generation is usually not desired when developing FEED_ALL_ATOM = None CATEGORY_FEED_ATOM = None TRANSLATION_FEED_ATOM = None AUTHOR_FEED_ATOM = None AUTHOR_FEED_RSS = None DISPLAY_CATEGORIES_ON_MENU = True DISPLAY_CATEGORIES_ON_SIDEBAR = False DISPLAY_PAGES_ON_MENU = True DISPLAY_TAGS_ON_SIDEBAR = True TAG_CLOUD_MAX_ITEMS = 10 DISQUS_SITENAME = 'cigadung' # Blogroll LINKS = None THEME = \"themes/pelican-bootstrap3\" BOOTSTRAP_THEME = 'paper' CUSTOM_CSS = 'static/custom.css' STATIC_PATHS = [ 'images' , 'extra/custom.css' ] EXTRA_PATH_METADATA = { 'extra/custom.css' : { 'path' : 'static/custom.css' } } DEFAULT_PAGINATION = 5 BANNER = 'images/cfc2.jpg' BANNER_SUBTITLE = 'Code, DevOps, Coffee & Fun' PLUGIN_PATHS = [ os . path . join ( os . environ . get ( 'HOME' ), 'statik/cigadung-pelican/pelican-plugins' )] PLUGINS = [ 'tipue_search' , 'tag_cloud' ] DIRECT_TEMPLATES = ( 'index' , 'categories' , 'authors' , 'archives' , 'search' ) ARCHIVES_SAVE_AS = 'archives.html' PYGMENTS_STYLE = 'default' DISPLAY_RECENT_POSTS_ON_SIDEBAR = True # Social widget SOCIAL = (( 'github' , 'http://github.com/cigadung' ),)","tags":"Coding","title":"Pelican-Install & Config"},{"url":"https://cigadung.github.io/blog/web-cigadung-fc","text":"Ok, ini seed post yg kedua, mau cerita sedikit tentang web Cigadung FC. Web Cigadung FC gak dikonsep untuk publishing artikel profesional. Masih sejalan dengan niatan awal CFC (ini disingkat ya, biar gak panjang, tp jangan diartikan temennya KFC ya :-D ..), web ini hanya untuk publish yg ringan-ringan dari kegiatan, belajar atau eksplorasi kita sehari-hari. Mau posting snipet boleh. Mau posting foto makan siang boleh. Mau posting dgn bahasa inggris OK, bahasa sunda atau jawa pun OK. Sementara ini rule-nya hanya satu: tidak nge-junk dan bermanfaat buat kita atau orang-lain. Kriteria lainnya adalah kontribusi bisa dilakukan banyak orang dan harus melalui banyak cara dan tidak terlalu old-school. Targetnya, sebelum pertengahan agustus, kita bs ngepost via bot yg dipasang di slack atau gitter. Setelah ditimang-timang, opsinya adalah generator web statik yang ringan. Dan yg masuk dalam pertimbangan: Nikola, Pelican, Hugo. Sebetulnya engine yg base-nya JS juga ada dan cukup menarik, tapi disimpan dulu untuk eksplorasi berikutnya. Pilihan jatuh ke Pelican . Sudah rada jadul sebetulnya. Plusnya: plugin dan pilihan theme-nya cukup banyak. Harapannya gak banyak utak-utik dan tinggal pakai. Betul tinggal pakai? :-D .. kayaknya gak jg, perlu tuning disana-sini.","tags":"misc","title":"Web Cigadung FC"},{"url":"https://cigadung.github.io/blog/pertamax","text":"Supaya bukan hello-world, first post-nya kita isi foto penampakan :-D Ini candid salah-satu acara rutin kita setiap hari jumat di Cigadung. Setiap minggu ada yg kebagian giliran untuk sharing ilmu kanuragan. Temanya bebas, tidak perlu tentang coding, dev dan sejenisnya, yg penting fun dan bermanfaat buat yg lain (tul gak?)..","tags":"People","title":"Pertamax"}]}